In [1]:
import pandas as pd
import numpy as np

In [2]:
data=pd.read_csv(r'C:\Users\Wasim\Desktop\Data_science_Projects\olx_rentdata\input_data\olx_rent_data.csv')

In [3]:
data.head(6)

,Type,bedroom,bathroom,furnishing,Carpet Area (ft²),Maintenance (Monthly),facing,Total floor,Rent
0,Houses & Villas,1,1,Unfurnished,350,200,North,2,"₹ 7,500"
1,Apartments,2,2,Unfurnished,810,5,Residential apartment,2,"₹ 18,500"
2,Apartments,3,2,Semi-Furnished,950,3500,East,4,"₹ 1,55,00,000"
3,-1,-1,-1,-1,-1,-1,-1,-1,-1
4,Apartments,2,1,Furnished,1,0,East,5,"₹ 10,000"
5,-1,-1,-1,-1,-1,-1,-1,-1,-1

In [4]:
data.shape

(1120, 9)

In [5]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1120 entries, 0 to 1119
Data columns (total 9 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   Type                   1120 non-null   object
 1   bedroom                1120 non-null   object
 2   bathroom               1120 non-null   object
 3   furnishing             1120 non-null   object
 4   Carpet Area (ft²)      1120 non-null   object
 5   Maintenance (Monthly)  1120 non-null   int64
 6   facing                 1120 non-null   object
 7   Total floor            1120 non-null   object
 8   Rent                   1120 non-null   object
dtypes: int64(1), object(8)
memory usage: 78.9+ KB

In [6]:
data.columns

Index(['Type', 'bedroom', 'bathroom', 'furnishing', 'Carpet Area (ft²)',
       'Maintenance (Monthly)', 'facing', 'Total floor', 'Rent'],
      dtype='object')

In [7]:
data['Maintenance (Monthly)'].value_counts()

-1       300
 0       272
 500      61
 2000     47
 1000     36
        ...
 650       1
 1890      1
 2600      1
 450       1
 2700      1
Name: Maintenance (Monthly), Length: 94, dtype: int64

In [8]:
data.bedroom.value_counts()

2     362
-1    300
1     260
3     178
4+     10
4      10
Name: bedroom, dtype: int64

In [9]:
df=data[data['Maintenance (Monthly)']!=-1]

In [10]:
df['Maintenance (Monthly)'].value_counts()

0       272
500      61
2000     47
1000     36
5000     28
       ...
220       1
1225      1
1800      1
197       1
1010      1
Name: Maintenance (Monthly), Length: 93, dtype: int64

In [11]:
df.shape

(820, 9)

In [12]:
df=df.drop_duplicates(ignore_index=True)

In [13]:
df.shape

(797, 9)

In [14]:
df.head()

,Type,bedroom,bathroom,furnishing,Carpet Area (ft²),Maintenance (Monthly),facing,Total floor,Rent
0,Houses & Villas,1,1,Unfurnished,350,200,North,2,"₹ 7,500"
1,Apartments,2,2,Unfurnished,810,5,Residential apartment,2,"₹ 18,500"
2,Apartments,3,2,Semi-Furnished,950,3500,East,4,"₹ 1,55,00,000"
3,Apartments,2,1,Furnished,1,0,East,5,"₹ 10,000"
4,Apartments,2,2,Unfurnished,833,12,Balaji Whitefield,12,"₹ 14,500"

In [ ]:
df['Rent']=df['Rent'].apply(lambda int(x):x.replace(['']))

In [ ]:
df.bedroom.value_counts()